<!-- dflook/terraform-github-actions {"workspace":"default","backend":"249ab1275accb93673dfbcd556a8057a5d19d32ef1a6aecf153b18eb35b300e1","backend_type":"gcs"} -->
Terraform plan in __examples/02-minimal-gcp-tf-bootstrap__
<details>
<summary>Plan: 5 to add, 0 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_app_engine_application.app will be created
  + resource "google_app_engine_application" "app" {
      + app_id            = (known after apply)
      + auth_domain       = (known after apply)
      + code_bucket       = (known after apply)
      + database_type     = (known after apply)
      + default_bucket    = (known after apply)
      + default_hostname  = (known after apply)
      + gcr_domain        = (known after apply)
      + id                = (known after apply)
      + location_id       = "***********"
      + name              = (known after apply)
      + project           = "pipetail-terraform"
      + serving_status    = (known after apply)
      + url_dispatch_rule = (known after apply)

      + feature_settings {
          + split_health_checks = (known after apply)
        }

      + iap {
          + enabled                     = (known after apply)
          + oauth2_client_id            = (known after apply)
          + oauth2_client_secret        = (sensitive value)
          + oauth2_client_secret_sha256 = (sensitive value)
        }
    }

  # google_logging_project_bucket_config.basic will be created
  + resource "google_logging_project_bucket_config" "basic" {
      + bucket_id       = "********"
      + description     = (known after apply)
      + id              = (known after apply)
      + lifecycle_state = (known after apply)
      + location        = "global"
      + name            = (known after apply)
      + project         = "pipetail-terraform"
      + retention_days  = 14
    }

  # google_project_service.services["iam.googleapis.com"] will be created
  + resource "google_project_service" "services" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "pipetail-terraform"
      + service            = "iam.googleapis.com"
    }

  # google_project_service.services["stackdriver.googleapis.com"] will be created
  + resource "google_project_service" "services" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "pipetail-terraform"
      + service            = "stackdriver.googleapis.com"
    }

  # google_storage_bucket.audit will be created
  + resource "google_storage_bucket" "audit" {
      + force_destroy               = true
      + id                          = (known after apply)
      + location                    = "EU"
      + name                        = "pipetail-terraform-audit-logs"
      + project                     = "pipetail-terraform"
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + uniform_bucket_level_access = true
      + url                         = (known after apply)

      + lifecycle_rule {
          + action {
              + type = "Delete"
            }

          + condition {
              + matches_storage_class = []
              + num_newer_versions    = 120
              + with_state            = (known after apply)
            }
        }

      + versioning {
          + enabled = true
        }
    }

Plan: 5 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [terraform-plan-02-minimal-gcp-tf-bootstrap #4](https://github.com/pipetail/terraform/actions/runs/2433668381)